app/views/movies/show.html.erb

SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`movie_id` = 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`movie_id` = 2  ORDER BY created_at DESC
---
            <h1 class="review_title"><%= @movie.title %></h1>
            <h2>No. of Reviews(<%= @movie.reviews.count() %>)</h2><br>