app/controllers/movies_controller.rb

  def index
    @search = Movie.search(params[:q])
---
SELECT `movies`.* FROM `movies`  ORDER BY created_at DESC

  def show
    @reviews = Review.where(movie_id: @movie.id).order("created_at DESC")
    if @reviews.blank?
          @avg_review = 0
        else
          @avg_review = @reviews.average(:rating).round(2)
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`movie_id` = 2  ORDER BY created_at DESC
SELECT AVG(`reviews`.`rating`) FROM `reviews` WHERE `reviews`.`movie_id` = 2

  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO `movies` (`title`, `description`, `movie_length`, `director`, `rating`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `user_id`, `created_at`, `updated_at`) VALUES ('Iron Man 3', 'Suit itself', '1:35:25', 'Tony Stark', '5', 'ir.jpg', 'image/jpeg', 18032, '2016-03-29 06:41:19', 1, '2016-03-29 06:41:20', '2016-03-29 06:41:20')

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE `movies` SET `image_file_name` = 'IronMan_Poster14_intl.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 47823, `image_updated_at` = '2016-03-29 06:50:24', `updated_at` = '2016-03-29 06:50:24' WHERE `movies`.`id` = 1

  def destroy
    @movie.destroy
---
DELETE FROM `movies` WHERE `movies`.`id` = 1

    def set_movie
      @movie = Movie.find(params[:id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1