app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT `reviews`.* FROM `reviews`

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id
      if @review.save
---
INSERT INTO `reviews` (`rating`, `comment`, `user_id`, `movie_id`, `created_at`, `updated_at`) VALUES (4, 'sdfsfsdvsv', 1, 4, '2016-03-29 09:42:29', '2016-03-29 09:42:29')

  def destroy
    @review.destroy
---
DELETE FROM `reviews` WHERE `reviews`.`id` = 2

    def set_review
      @review = Review.find(params[:id])
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 2 LIMIT 1

def set_movie
  @movie = Movie.find(params[:movie_id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 4 LIMIT 1